
while True:
    card_number = list(input('Введите номер карты: '))
    if len(card_number) < 16:
        print('ввели меньше 16 символов!')
    elif len(card_number) > 16:
        print('ввели больше 16 символов!')
    else:
        #производим вычисления
        p_0 = int(card_number[0]) # 1 элемент строки
        p_1 = int(card_number[1]) # 2 элемент строки
        p_2 = int(card_number[2]) # 3 элемент строки
        p_3 = int(card_number[3]) # 4 элемент строки
        p_4 = int(card_number[4]) # 5 элемент строки
        p_5 = int(card_number[5]) # 6 элемент строки
        p_6 = int(card_number[6]) # 7 элемент строки
        p_7 = int(card_number[7]) # 8 элемент строки
        p_8 = int(card_number[8]) # 9 элемент строки
        p_9 = int(card_number[9]) # 10 элемент строки
        p_10 = int(card_number[10]) # 11 элемент строки
        p_11 = int(card_number[11]) # 12 элемент строки
        p_12 = int(card_number[12]) # 13 элемент строки
        p_13 = int(card_number[13]) # 14 элемент строки
        p_14 = int(card_number[14]) # 15 элемент строки
        p_15 = int(card_number[15]) # 16 элемент строки

        #Проверка для первого элемента
        if (2 * p_0) > 9:
            p_0 = (2 * p_0) - 9
        else:
            p_0 = 2 * p_0

        #Проверка для третьего элемента
        if (2 * p_2) > 9:
            p_2 = (2 * p_2) - 9
        else:
            p_2 = 2 * p_2

        #Проверка для пятого элемента
        if (2 * p_4) > 9:
            p_4 = (2 * p_4) - 9
        else:
            p_4 = 2 * p_4

        #Проверка для седьмого элемента
        if (2 * p_6) > 9:
            p_6 = (2 * p_6) - 9
        else:
            p_6 = 2 * p_6

        #Проверка для девятого элемента
        if (2 * p_8) > 9:
            p_8 = (2 * p_8) - 9
        else:
            p_8 = 2 * p_8

        #Проверка для одиннадцатого элемента
        if (2 * p_10) > 9:
            p_10 = (2 * p_10) - 9
        else:
            p_10 = 2 * p_10

        # Проверка для триннадцатого элемента
        if (2 * p_12) > 9:
            p_12 = (2 * p_12) - 9
        else:
            p_12 = 2 * p_12

        # Проверка для пятнадцатого элемента
        if (2 * p_14) > 9:
            p_14 = (2 * p_14) - 9
        else:
            p_14 = 2 * p_14
        # результат как сложение всех элементов
        result = p_0 + p_1 + p_2 + p_3 + p_4 + p_5 + p_6 + p_7 + p_8 + p_9 + p_10 + p_11 + p_12 + p_13 + p_14 + p_15

        # проверка кратности числа 10-ти
        if result % 10 == 0:
            print("Карта валидна.", result)
            break
        else:
            print("Карта не валидна.", result)
            break






















